// コメントコーディング

// カードの山
// 自分のカード
// 相手のカード

//　イベントハンドラの割り当て

// ページの読み込みが完了したとき実行する関数を登録
// カードを引くボタンを押したとき実行する関数を登録
// 勝負するボタンを押したときに実行する関数を登録
// もう一回遊ぶボタンを押したときに実行する関数を登録

//　イベントハンドラ

// ページの読み込みが完了した時実行する関数
function 初期表示() {
  // 自分がカードを引く
  // 相手がカードを引く
  // 画面を更新する
}

// カードを引くボタンを押したときに実行する関数
function カードを引く() {
  // 自分がカードを引く
  // 相手がカードを引く
  // 画面を更新する
}

// 勝負する！ボタンを押したとき実行する関数
function 勝負する() {
  //　勝敗を判定する
  // 勝敗を画面に表示する
}

// もう一回遊ぶボタンを押したとき実行する関数
function もう一回遊ぶ(){
  // 画面を初期表示に戻す
}